---
type: EnergyAnalysisSpace
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 11
tags: [revit-api, class]
---

# EnergyAnalysisSpace

`Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAnalyticalSurfaces | 2012 | `public IList < EnergyAnalysisSurface > GetAnalyticalSurfaces ()` |
| Method | GetBoundary | 2012 | `public IList < Polyloop > GetBoundary ()` |
| Method | GetClosedShell | 2012 | `public IList < Polyloop > GetClosedShell ()` |
| Property | Area | 2012 | `public double Area { get ; }` |
| Property | CADObjectUniqueId | 2012 | `public string CADObjectUniqueId { get ; }` |
| Property | ComposedName | 2012 | `public string ComposedName { get ; }` |
| Property | Description | 2012 | `public string Description { get ; }` |
| Property | Number | 2012 | `public string Number { get ; }` |
| Property | Parameter | — | `` |
| Property | SpaceName | 2012 | `public string SpaceName { get ; }` |
| Property | Volume | 2023 | `public double Volume { get ; }` |